In [1]:
import pandas as pd
from typing import List

/opt/conda/lib/python3.9/site-packages/pandas/core/computation/expressions.py:21: UserWarning: Pandas requires version '2.8.4' or newer of 'numexpr' (version '2.8.0' currently installed).
  from pandas.core.computation.check import NUMEXPR_INSTALLED
/opt/conda/lib/python3.9/site-packages/pandas/core/arrays/masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.4' currently installed).
  from pandas.core import (

In [2]:
pd.read_excel('./participants.xlsx')

   user_id   name  age  country  score continent
0     1001   Mark   55    Italy    4.5    Europe
1     1000   John   33      USA    6.7   America
2     1002    Tim   41      USA    3.9   America
3     1003  Jenny   12  Germany    9.0    Europe

In [3]:
# create a DataFrame from scratch
data: List[list] = [['Mark', 55, 'Italy', 4.5, 'Europe'],
                    ['John', 33, 'USA', 6.7, 'America'],
                    ['Tim', 41, 'USA', 3.9, 'America'],
                    ['Jenny', 12, 'Germany', 9.0, 'Europe']]

df: pd.DataFrame = pd.DataFrame(data=data,
                                columns=['name', 'age', 'country', 'score', 'continent'],
                                index=[1001, 1000, 1002, 1003])

df

       name  age  country  score continent
1001   Mark   55    Italy    4.5    Europe
1000   John   33      USA    6.7   America
1002    Tim   41      USA    3.9   America
1003  Jenny   12  Germany    9.0    Europe

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 1001 to 1003
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       4 non-null      object
 1   age        4 non-null      int64
 2   country    4 non-null      object
 3   score      4 non-null      float64
 4   continent  4 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 192.0+ bytes

# Index

In [5]:
df.index

Index([1001, 1000, 1002, 1003], dtype='int64')

In [6]:
df.index.name = 'user_id'
df

          name  age  country  score continent
user_id
1001      Mark   55    Italy    4.5    Europe
1000      John   33      USA    6.7   America
1002       Tim   41      USA    3.9   America
1003     Jenny   12  Germany    9.0    Europe

## "reset_index" turns the index into a column, replacing the index with the default index.

In [7]:
df.reset_index()

   user_id   name  age  country  score continent
0     1001   Mark   55    Italy    4.5    Europe
1     1000   John   33      USA    6.7   America
2     1002    Tim   41      USA    3.9   America
3     1003  Jenny   12  Germany    9.0    Europe

## "reset_index" turns "user_id" into a regular column and "set_index" turns the column "name" into the index

In [8]:
df.reset_index().set_index("name")

       user_id  age  country  score continent
name
Mark      1001   55    Italy    4.5    Europe
John      1000   33      USA    6.7   America
Tim       1002   41      USA    3.9   America
Jenny     1003   12  Germany    9.0    Europe

## "reindex" changes the values of index

In [9]:
df.reindex([999, 1000, 1001, 1003])

          name   age  country  score continent
user_id
999        NaN   NaN      NaN    NaN       NaN
1000      John  33.0      USA    6.7   America
1001      Mark  55.0    Italy    4.5    Europe
1003     Jenny  12.0  Germany    9.0    Europe

### sorting index

In [10]:
df.sort_index()

          name  age  country  score continent
user_id
1000      John   33      USA    6.7   America
1001      Mark   55    Italy    4.5    Europe
1002       Tim   41      USA    3.9   America
1003     Jenny   12  Germany    9.0    Europe

In [11]:
# original order of the index
df

          name  age  country  score continent
user_id
1001      Mark   55    Italy    4.5    Europe
1000      John   33      USA    6.7   America
1002       Tim   41      USA    3.9   America
1003     Jenny   12  Germany    9.0    Europe

### sorting rows by multiple columns

In [12]:
df.sort_values(['continent', 'age'])

          name  age  country  score continent
user_id
1000      John   33      USA    6.7   America
1002       Tim   41      USA    3.9   America
1003     Jenny   12  Germany    9.0    Europe
1001      Mark   55    Italy    4.5    Europe

### sorting rows by single column

In [13]:
df.sort_values(['continent'])

          name  age  country  score continent
user_id
1000      John   33      USA    6.7   America
1002       Tim   41      USA    3.9   America
1001      Mark   55    Italy    4.5    Europe
1003     Jenny   12  Germany    9.0    Europe

# Column

In [14]:
# Get the columns of a DataFrame
df.columns

Index(['name', 'age', 'country', 'score', 'continent'], dtype='object')

## Give a name to the set of columns

In [15]:
df.columns.name = 'properties'
df

properties   name  age  country  score continent
user_id
1001         Mark   55    Italy    4.5    Europe
1000         John   33      USA    6.7   America
1002          Tim   41      USA    3.9   America
1003        Jenny   12  Germany    9.0    Europe

### rename columns

In [16]:
df.rename(columns={'name': 'First Name', 'age': 'Age'})

properties First Name  Age  country  score continent
user_id
1001             Mark   55    Italy    4.5    Europe
1000             John   33      USA    6.7   America
1002              Tim   41      USA    3.9   America
1003            Jenny   12  Germany    9.0    Europe

## Delete particular columns and rows

In [17]:
df.drop(columns=['name', 'country'], index=[1000, 1003])

properties  age  score continent
user_id
1001         55    4.5    Europe
1002         41    3.9   America

## Transposition of the DataFrame

In [18]:
df.T

user_id       1001     1000     1002     1003
properties
name          Mark     John      Tim    Jenny
age             55       33       41       12
country      Italy      USA      USA  Germany
score          4.5      6.7      3.9      9.0
continent   Europe  America  America   Europe

In [19]:
df.transpose()

user_id       1001     1000     1002     1003
properties
name          Mark     John      Tim    Jenny
age             55       33       41       12
country      Italy      USA      USA  Germany
score          4.5      6.7      3.9      9.0
continent   Europe  America  America   Europe

## Reorder the columns

In [20]:
df.loc[:, ['continent', 'country', 'name', 'age', 'score']]

properties continent  country   name  age  score
user_id
1001          Europe    Italy   Mark   55    4.5
1000         America      USA   John   33    6.7
1002         America      USA    Tim   41    3.9
1003          Europe  Germany  Jenny   12    9.0

## Selecting data by label
#### df.loc[row_selection, column_selection]

#### slicing in DataFrame selection includes upperbound

In [21]:
df.loc[1001, 'name']

'Mark'

In [22]:
df.loc[[1001, 1002], 'age']

user_id
1001    55
1002    41
Name: age, dtype: int64

In [23]:
df.loc[:1002, ['name', 'country']]

properties  name country
user_id
1001        Mark   Italy
1000        John     USA
1002         Tim     USA

In [24]:
df.loc[:, 'country']

user_id
1001      Italy
1000        USA
1002        USA
1003    Germany
Name: country, dtype: object

In [25]:
df['country']

user_id
1001      Italy
1000        USA
1002        USA
1003    Germany
Name: country, dtype: object

In [26]:
df.loc[:, ['name', 'country']]

properties   name  country
user_id
1001         Mark    Italy
1000         John      USA
1002          Tim      USA
1003        Jenny  Germany

In [27]:
df[['name', 'country']]

properties   name  country
user_id
1001         Mark    Italy
1000         John      USA
1002          Tim      USA
1003        Jenny  Germany

## Selecting data by position
#### df.iloc[row_selection, column_selection]

In [28]:
df.iloc[0, 0]  # Returns a scalar

'Mark'

In [29]:
df.iloc[[0, 2], 1]  # Returns a Series

user_id
1001    55
1002    41
Name: age, dtype: int64

In [30]:
df.iloc[:3, [0, 2]]  # Returns a DataFrame

properties  name country
user_id
1001        Mark   Italy
1000        John     USA
1002         Tim     USA

## Selecting data by boolean indexing

In [31]:
# filter users who is living in the USA and having an age greater than or equal to 40 years old
tf = (df['age'] > 40) & (df['country'] == 'USA')
tf  # a series with only True/False

user_id
1001    False
1000    False
1002     True
1003    False
dtype: bool

In [32]:
df.loc[tf, :]

properties name  age country  score continent
user_id
1002        Tim   41     USA    3.9   America

In [33]:
df.loc[df.index > 1001, :]

properties   name  age  country  score continent
user_id
1002          Tim   41      USA    3.9   America
1003        Jenny   12  Germany    9.0    Europe

In [34]:
df.loc[df['country'].isin(['Italy', 'Germany']), :]

properties   name  age  country  score continent
user_id
1001         Mark   55    Italy    4.5    Europe
1003        Jenny   12  Germany    9.0    Europe

In [35]:
# This could be the yearly rainfall in millimeteres
rainfall = pd.DataFrame(data={'City 1': [300.1, 100.2],
                              'City 2': [400.3, 300.4],
                              'City 3': [1000.5, 1100.6]})

rainfall

   City 1  City 2  City 3
0   300.1   400.3  1000.5
1   100.2   300.4  1100.6

In [36]:
rainfall < 400

   City 1  City 2  City 3
0    True   False   False
1    True    True   False

In [37]:
rainfall[rainfall < 400]

   City 1  City 2  City 3
0   300.1     NaN     NaN
1   100.2   300.4     NaN

## Selecting data by MultiIndex

In [38]:
# A MultiIndex needs to be sorted
df_multi = df.reset_index().set_index(['continent', 'country'])
df_multi = df_multi.sort_index()
df_multi

properties         user_id   name  age  score
continent country
America   USA         1000   John   33    6.7
          USA         1002    Tim   41    3.9
Europe    Germany     1003  Jenny   12    9.0
          Italy       1001   Mark   55    4.5

In [39]:
df_multi.loc['Europe', :]

properties  user_id   name  age  score
country
Germany        1003  Jenny   12    9.0
Italy          1001   Mark   55    4.5

### Use tuple to select multi index

In [40]:
df_multi.loc[('Europe', 'Italy'), :]

properties         user_id  name  age  score
continent country
Europe    Italy       1001  Mark   55    4.5

In [41]:
df_multi

properties         user_id   name  age  score
continent country
America   USA         1000   John   33    6.7
          USA         1002    Tim   41    3.9
Europe    Germany     1003  Jenny   12    9.0
          Italy       1001   Mark   55    4.5

In [42]:
# reset index by the first left column if level is 0 
df_multi.reset_index(level=0)

properties continent  user_id   name  age  score
country
USA          America     1000   John   33    6.7
USA          America     1002    Tim   41    3.9
Germany       Europe     1003  Jenny   12    9.0
Italy         Europe     1001   Mark   55    4.5

In [43]:
df_multi.reset_index(level=1)

properties  country  user_id   name  age  score
continent
America         USA     1000   John   33    6.7
America         USA     1002    Tim   41    3.9
Europe      Germany     1003  Jenny   12    9.0
Europe        Italy     1001   Mark   55    4.5

## Setting data by label or position

In [44]:
df2 = df.copy()

In [45]:
df2.loc[1000, 'name'] = 'John'
df2

properties   name  age  country  score continent
user_id
1001         Mark   55    Italy    4.5    Europe
1000         John   33      USA    6.7   America
1002          Tim   41      USA    3.9   America
1003        Jenny   12  Germany    9.0    Europe

In [46]:
df2.loc[[1000, 1001], 'score'] = [3, 4]
df2

properties   name  age  country  score continent
user_id
1001         Mark   55    Italy    4.0    Europe
1000         John   33      USA    3.0   America
1002          Tim   41      USA    3.9   America
1003        Jenny   12  Germany    9.0    Europe

## Setting data by boolean indexing

In [47]:
tf = (df2['age'] < 20) | (df2['country'] == 'USA')
df2.loc[tf, 'name'] = 'xxx'
df2

properties  name  age  country  score continent
user_id
1001        Mark   55    Italy    4.0    Europe
1000         xxx   33      USA    3.0   America
1002         xxx   41      USA    3.9   America
1003         xxx   12  Germany    9.0    Europe

## Missing data

In [48]:
df2 = df.copy()
df2.loc[1000, 'score'] = None
df2.loc[1003, :] = None
df2

properties  name   age country  score continent
user_id
1001        Mark  55.0   Italy    4.5    Europe
1000        John  33.0     USA    NaN   America
1002         Tim  41.0     USA    3.9   America
1003        None   NaN    None    NaN      None

## dropping rows if any none in the row

In [49]:
df2.dropna()

properties  name   age country  score continent
user_id
1001        Mark  55.0   Italy    4.5    Europe
1002         Tim  41.0     USA    3.9   America

## dropping rows if all values are none

In [50]:
df2.dropna(how='all')

properties  name   age country  score continent
user_id
1001        Mark  55.0   Italy    4.5    Europe
1000        John  33.0     USA    NaN   America
1002         Tim  41.0     USA    3.9   America

## Get boolean dataframe or series depending on whether NaN exists

In [51]:
df2.isna()

properties   name    age  country  score  continent
user_id
1001        False  False    False  False      False
1000        False  False    False   True      False
1002        False  False    False  False      False
1003         True   True     True   True       True

## Fill something for missing data

In [52]:
df2

properties  name   age country  score continent
user_id
1001        Mark  55.0   Italy    4.5    Europe
1000        John  33.0     USA    NaN   America
1002         Tim  41.0     USA    3.9   America
1003        None   NaN    None    NaN      None

In [53]:
# replace NaN in column score with the mean of all score values 
df2.fillna({'score': df2['score'].mean()})

properties  name   age country  score continent
user_id
1001        Mark  55.0   Italy    4.5    Europe
1000        John  33.0     USA    4.2   America
1002         Tim  41.0     USA    3.9   America
1003        None   NaN    None    4.2      None

## dropping duplicate data

In [54]:
df

properties   name  age  country  score continent
user_id
1001         Mark   55    Italy    4.5    Europe
1000         John   33      USA    6.7   America
1002          Tim   41      USA    3.9   America
1003        Jenny   12  Germany    9.0    Europe

In [55]:
df.drop_duplicates(['country', 'continent'])

properties   name  age  country  score continent
user_id
1001         Mark   55    Italy    4.5    Europe
1000         John   33      USA    6.7   America
1003        Jenny   12  Germany    9.0    Europe

## checking if the particular columns include duplicates

In [56]:
df['country']

user_id
1001      Italy
1000        USA
1002        USA
1003    Germany
Name: country, dtype: object

In [57]:
df['country'].is_unique

False

## get the series of unique values in a particular column

In [58]:
df['country'].unique()

array(['Italy', 'USA', 'Germany'], dtype=object)

In [59]:
# by default, it marks only duplicates as True, i.e. without the first occurrence
df['country'].duplicated()

user_id
1001    False
1000    False
1002     True
1003    False
Name: country, dtype: bool

In [60]:
# any duplicated index
df.index.duplicated()

array([False, False, False, False])

In [61]:
# any duplicated index
df.duplicated()

user_id
1001    False
1000    False
1002    False
1003    False
dtype: bool

In [62]:
# To get all rows where country is duplicated, use keep=False
df.loc[df['country'].duplicated(keep=False)]

properties  name  age country  score continent
user_id
1000        John   33     USA    6.7   America
1002         Tim   41     USA    3.9   America

# Vectorisation

In [63]:
rainfall

   City 1  City 2  City 3
0   300.1   400.3  1000.5
1   100.2   300.4  1100.6

In [64]:
rainfall + 100

   City 1  City 2  City 3
0   400.1   500.3  1100.5
1   200.2   400.4  1200.6

## data alignment

In [65]:
more_rainfall = pd.DataFrame(data=[[100, 200], [300, 400]],
                             index=[1, 2],
                             columns=['City 1', 'City 4'])

more_rainfall

   City 1  City 4
1     100     200
2     300     400

In [66]:
rainfall + more_rainfall

   City 1  City 2  City 3  City 4
0     NaN     NaN     NaN     NaN
1   200.2     NaN     NaN     NaN
2     NaN     NaN     NaN     NaN

In [67]:
# columns and rows in rainfall but not in more_rainfall will be 0 to be added to rainfall
rainfall.add(more_rainfall, fill_value=0)

   City 1  City 2  City 3  City 4
0   300.1   400.3  1000.5     NaN
1   200.2   300.4  1100.6   200.0
2   300.0     NaN     NaN   400.0

In [68]:
rainfall

   City 1  City 2  City 3
0   300.1   400.3  1000.5
1   100.2   300.4  1100.6

In [69]:
rainfall.loc[1, :]

City 1     100.2
City 2     300.4
City 3    1100.6
Name: 1, dtype: float64

In [70]:
# by default, a series taken from a row
# each row in rainfall will be added a series of rainfall.loc[1, :]
rainfall + rainfall.loc[1, :]

   City 1  City 2  City 3
0   400.3   700.7  2101.1
1   200.4   600.8  2201.2

In [71]:
rainfall.loc[:, 'City 2']

0    400.3
1    300.4
Name: City 2, dtype: float64

In [72]:
# axis=0, a sereis taken from a column
# each column in rainfall will be added a series of rainfall.loc[:, 'City 2']
rainfall.add(rainfall.loc[:, 'City 2'], axis=0)

   City 1  City 2  City 3
0   700.4   800.6  1400.8
1   400.6   600.8  1401.0

## Manipulating text columns

In [73]:
users = pd.DataFrame(data=[' mArk ', 'JOHN  ', 'Tim', ' jenny'],
                     columns=['name'])

users

     name
0   mArk
1  JOHN
2     Tim
3   jenny

In [74]:
users_cleaned = users.loc[:, 'name'].str.strip().str.capitalize()
users_cleaned

0     Mark
1     John
2      Tim
3    Jenny
Name: name, dtype: object

In [75]:
# Find users who have a name started with J
users_cleaned.str.startswith('J')

0    False
1     True
2    False
3     True
Name: name, dtype: bool

# Apply function to DataFrame using $map$

In [76]:
rainfall

   City 1  City 2  City 3
0   300.1   400.3  1000.5
1   100.2   300.4  1100.6

In [77]:
def format_string(x):
    return f"{x:,.2f}"

In [78]:
rainfall.map(format_string)

   City 1  City 2    City 3
0  300.10  400.30  1,000.50
1  100.20  300.40  1,100.60

In [79]:
rainfall.map(lambda x: f"{x:,.2f}")

   City 1  City 2    City 3
0  300.10  400.30  1,000.50
1  100.20  300.40  1,100.60

## Combining dataframes by $concat$

In [80]:
data = [[15, 'France', 4.1, 'Becky'],
        [30, 'Canada', 6.1, 'Leanne']]

more_users = pd.DataFrame(data=data,
                          columns=['age', 'country', 'score', 'name'],
                          index=[1000, 1011])

more_users

      age country  score    name
1000   15  France    4.1   Becky
1011   30  Canada    6.1  Leanne

In [81]:
df

properties   name  age  country  score continent
user_id
1001         Mark   55    Italy    4.5    Europe
1000         John   33      USA    6.7   America
1002          Tim   41      USA    3.9   America
1003        Jenny   12  Germany    9.0    Europe

In [82]:
# concatenation of rows and auto column alignment
pd.concat([df, more_users], axis=0)

        name  age  country  score continent
1001    Mark   55    Italy    4.5    Europe
1000    John   33      USA    6.7   America
1002     Tim   41      USA    3.9   America
1003   Jenny   12  Germany    9.0    Europe
1000   Becky   15   France    4.1       NaN
1011  Leanne   30   Canada    6.1       NaN

In [83]:
data = [[3, 4],
        [5, 6]]

more_categories = pd.DataFrame(data=data,
                               columns=['quizzes', 'logins'],
                               index=[1000, 2000])

more_categories

      quizzes  logins
1000        3       4
2000        5       6

In [84]:
# concatenation of columns by setting axis=1
pd.concat([df, more_categories], axis=1)

       name   age  country  score continent  quizzes  logins
1001   Mark  55.0    Italy    4.5    Europe      NaN     NaN
1000   John  33.0      USA    6.7   America      3.0     4.0
1002    Tim  41.0      USA    3.9   America      NaN     NaN
1003  Jenny  12.0  Germany    9.0    Europe      NaN     NaN
2000    NaN   NaN      NaN    NaN       NaN      5.0     6.0

In [85]:
# combine multiple CSV files using concat
# pd.concat([df1, df2, df3, ...])

## Combining dataframes using $join$ and $merge$

In [86]:
df1 = pd.DataFrame(data=[[1, 2], [3, 4], [5, 6]],
                   columns=['A', 'B'])

df1

   A  B
0  1  2
1  3  4
2  5  6

In [87]:
df2 = pd.DataFrame(data=[[10, 20], [30, 40]],
                   columns=['C', 'D'], index=[1, 3])

df2

    C   D
1  10  20
3  30  40

In [88]:
df1.join(df2, how='inner')

   A  B   C   D
1  3  4  10  20

In [89]:
df1.join(df2, how='left')

   A  B     C     D
0  1  2   NaN   NaN
1  3  4  10.0  20.0
2  5  6   NaN   NaN

In [90]:
df1.join(df2, how='right')

     A    B   C   D
1  3.0  4.0  10  20
3  NaN  NaN  30  40

In [91]:
df1.join(df2, how='outer')

     A    B     C     D
0  1.0  2.0   NaN   NaN
1  3.0  4.0  10.0  20.0
2  5.0  6.0   NaN   NaN
3  NaN  NaN  30.0  40.0

In [92]:
# Add a column called category to both dataframes
df1['category'] = ['a', 'b', 'c']
df2['category'] = ['c', 'b']

In [93]:
df1

   A  B category
0  1  2        a
1  3  4        b
2  5  6        c

In [94]:
df2

    C   D category
1  10  20        c
3  30  40        b

In [95]:
# the rows in df1 and df2 have same values will be merged together
df1.merge(df2, how='inner', on=['category'])

   A  B category   C   D
0  3  4        b  30  40
1  5  6        c  10  20

In [96]:
# the rows in df2 have same values of column category to df1 will be merged to df1
df1.merge(df2, how='left', on=['category'])

   A  B category     C     D
0  1  2        a   NaN   NaN
1  3  4        b  30.0  40.0
2  5  6        c  10.0  20.0

## Descriptive Statistics & Data Aggregation

### Descriptive Statistics

In [97]:
rainfall

   City 1  City 2  City 3
0   300.1   400.3  1000.5
1   100.2   300.4  1100.6

In [98]:
# mean of rach column by default
rainfall.mean()

City 1     200.15
City 2     350.35
City 3    1050.55
dtype: float64

In [99]:
# mean of each row if axis=1
rainfall.mean(axis=1)  # NaN will be ignored

0    566.966667
1    500.400000
dtype: float64

### Data Aggregation by groupby & agg

In [100]:
df

properties   name  age  country  score continent
user_id
1001         Mark   55    Italy    4.5    Europe
1000         John   33      USA    6.7   America
1002          Tim   41      USA    3.9   America
1003        Jenny   12  Germany    9.0    Europe

In [104]:
df.groupby(['continent'])[['age', 'score']].mean()

properties   age  score
continent
America     37.0   5.30
Europe      33.5   6.75

In [106]:
df.groupby(['continent', 'country'])[['age', 'score']].mean()

properties          age  score
continent country
America   USA      37.0    5.3
Europe    Germany  12.0    9.0
          Italy    55.0    4.5

In [108]:
df.groupby(['continent'])[['age', 'score']].agg(lambda x: x.max() - x.min())

properties  age  score
continent
America       8    2.8
Europe       43    4.5